[{"permalink":"//","layout":"default","title":"Syllabus - CMSC 334 Computer Security","content":"# Syllabus - CMSC 334 Computer Security\n\n### Instructor\n\n* **Instructor:** Dr. David Balash\n* **Email:** [david.balash@richmond.edu](mailto:david.balash@richmond.edu)\n* **Office Hours:** (Jepson 223)\n * Tue 4:30PM - 5:30PM\n * Fri 3:00PM - 5:00PM\n * and by appointment at [https://calendly.com/davidbalash](https://calendly.com/davidbalash) or by email\n\n### Meeting Times\n\n* Lecture (Jepson G03)\n * Tue 3:00PM - 4:15PM\n * Thr 3:00PM - 4:15PM\n* Lab (Jespson G04)\n * Fri 1:30PM - 2:20PM\n\n\n## Welcome to Computer Security! \n\n### Course Description \n\nThis course provides a foundational understanding of computer and network security. It covers key topics such as securing accounts and data, encryption and authentication techniques, and the security of software and systems. The course also delves into web security, networking fundamentals, and network security practices, while highlighting the importance of usable security and privacy. With a focus on practical application and developing a proactive security mindset, this course is well-suited for those looking to gain essential knowledge in the field of computer and network security.\n\n### Learning Outcomes\nBy the end of this course, you will:\n\n- Understand the foundational theories behind computer security.\n- Learn about various mechanisms employed in securing systems and data.\n- Gain practical skills in implementing security measures.\n- Acquire basic knowledge and skills in using Linux, an important platform for many security tools and environments.\n- Learn methods to secure user accounts, including password management and access controls.\n- Understand and apply cryptographic techniques for data protection, such as encryption and decryption.\n- Gain knowledge about securing software applications and operating systems against vulnerabilities and threats.\n- Understand web security challenges and learn to protect web applications and services.\n- Learn the basics of computer networking, essential for understanding network security.\n- Acquire skills in securing networks against unauthorized access and attacks.\n- Cultivate an ongoing awareness and proactive approach to security in all aspects of computing.\n\n\n### Course Outline\n\n* Security Principles\n * Introduction, Goals of Computer Security, Ethics\n * Policy, Threat Models, and Mechanisms\n * Trusted Computing Bases\n* Linux Fundamentals\n* Securing Accounts\n * Passwords, Two-Factor Authentication, Credential Stuffing\n * Social Engineering, Phishing\n* Securing Data (Applied Cryptography)\n * Hashing\n * Secret-Key Cryptography, Public-Key Cryptography\n * Digital Signatures, Passkeys\n * Encryption in Transit, Encryption at Rest\n* Securing Software and Systems\n * Principle of Least Privilege, Access Control\n * Operating Systems Security\n * Control Hijacking Attacks, Buffer Overflows\n* Web Security\n * SQL Injection and Command Injection\n * Client-Side and Server-Side Validation\n * Cross-Site Scripting\n* Networking Fundamentals\n* Network Security\n * Security Problems in the TCP/IP Protocol Suite\n * DDoS Attacks, Network Defenses\n* Usable Security and Privacy\n\n\n## Textbook and Resources\n\n### Textbook\n\nThere will be assigned reading from the following book which is available electronically for free on the authors web site. \n\n- [Computer Security and the Internet: Tools and Jewels from Malware to Bitcoin, Second Edition](https://people.scs.carleton.ca/~paulv/toolsjewels.html) by Paul C. van Oorschot \n\n\n## Coursework and Grading\n\n### Course Work\n- In-class module exercises\n- Lab assignments\n- Class project\n- Project presentation\n- 5 Online reading quizzes\n\n### Grading Breakdown\n * 15%: Reading Reactions\n * 40%: Labs \n * 20%: Project\n * 5%: Project Presentation \n * 20%: Modules (In-class exercises)\n\n\n### Attendance Policy\nRegular attendance for the entire class time is expected. You should not miss more than 4 total sessions (including lecture and lab). If you have to quarantine due to COVID or miss class for other legitimate reasons you will not be penalized.\n\n### Late Work Policy\n\nAssignments including modules and labs may be submitted late with a **10%** deduction **per day** late. In cases of personal illnesses, emergencies, or documented accommodations, assignments may be submitted late for full credit if you notify me of your situation. \n\n### Self-Guided Module exercises\n\nEach lecture will be accompanied by a *self-guided worksheet*. This module exercise is to complement in-class content and to assist you in reviewing the material. In-class module exercises are due one week from the lecture in which they are assigned. \n\n### Reading Assignments\n\nYou will read and write a reaction four to assigned research papers. Reactions should consist of three brief paragraphs of prose (not bullet points) in your own words. A detailed description structure of these reading reaction assignments will be provided.\n\nYou will read and provide discussion question responses to chapters assigned from the course text. See course schedule for details. \n\n### Labs\n\nLabs are short-to-medium size hands-on computer security assignments that are designed to reinforce lecture. This course has a formal laboratory component. You are expected to attend each lab for the entire 50 minute lab period. Some labs may require that you work in teams of two or more. Almost all labs will require more than the 50 minute alloted time to complete, so please expect to have to spend extra time on the labs.\n\nLabs are due at 11:59 pm on the night prior to the next lab (for this course, that means 11:59 pm Thursday evening), unless I explicitly provide a different deadline. Note that some labs are more extensive, so might require two weeks to complete. In that case I will explicitly inform you of this. \n \n### Class Project and Presentation\n\nYou will work on a class project of your own choice. You will work in groups of 2 for the project. You will be required to turn in both your code and a short write-up describing the design and implementation of your project, and to make a short in-class presentation about your work. \n\n## Class Communication\n\nI will use two primary forms of communication in this class: email announcements and Slack. You are responsible for remaining up to date on any information sent by email or posted to Slack. This may include clarifications to assignments, updates on grading rubrics, and changes in office hours. \n\nFor all general course information, questions, and clarifications, please use Slack. I hope that the Slack workspace can be an extension of our classroom community where we can share questions and answers for the entire class to view and learn from.\n\nIf you have personal, individual issues you'd like addressed, you should send those by email to me. However, all course related topics should be directed to Slack.\n\n\n## Course Policies\n\n### Illness policy\n\nIf you are ill and it will cause you to miss class, lab, or an assignment, you should let me know in advance, if possible. It is your responsibility to catch up with any missed material if you are able to do so. If not, then immediately on return, work out a time-frame with me on when work will be submitted. \n\n\n### Academic Integrity policy\n\nIt is very important in this course (and in life), that your work be your own. These guidelines will help you achieve that.\n\nYou must:\n\n- Do your best to solve all homework, projects, labs, and exams on your own.\n- Write the names of any students you collaborated with as a comment at the top of your file (subject to the constraints below).\n\nYou may:\n\n- Discuss general approaches to solving the homework problems with other students, but the pen-to-paper, fingers-to-keyboard work should be your own. \n- Have another student look at a specific snippet of your code (e.g., 10 lines) to help you debug a programming error.\n\nYou may not:\n\n- Copy code to or from other students or people outside of the class.\n- Have someone else write code for you.\n- Copy code from the internet, unless you specifically reference the source and can explain how it works. This should be a tiny minority of the code you submit.\n- Write code as a group and then submit identical or slightly modified versions---if you discuss general approaches to solving a problem together, you still must be writing up your own independent solution.\n\nThe [Honor Code](https://studentdevelopment.richmond.edu/student-handbook/honor/Honor-Code-January-2023.pdf) will apply to this course. Please read through the code carefully.\n\n\n\n### Generative AI\n\nYou will almost certainly be using generative AI in some way for the rest of your career. You may use generative AI tools for homework, labs, and project in the following manner.\n\nYou must: \n- Understand any code that you use. We reserve the right to review your submitted code with you, and ask you to explain how it works. \n\nYou may:\n- Ask a GenAI tool a generic question for informational purposes. For example, \"Please explain the C++ syntax for reading input from a file, and give an example.\" If you use this code, please cite the source in a comment.\n\nYou may not:\n- Ask a GenAI tool to solve the assignment. For example, you should not paste the entire problem description and ask the GenAI to solve it for you.\n- No GenAI tools can be used for the exams.\n\nThis policy is subject to change as we all learn more about how GenAI works and doesn’t work as part of learning college level course content.\n\n\n\n### Disability Services \n\nAny student who may need an accommodation based on the potential impact of a disability should contact [Disability Services](https://disability.richmond.edu/) (or call 804-662-5001) to establish eligibility and to coordinate reasonable accommodations. \n\nIf you are approved for classroom and/or testing accommodation(s) please make sure to submit a Disability Accommodation Notice to me at this [link](https://disabilityportal.richmond.edu/ClockWork/user/selfregC/courses.aspx).\n\n\n## Wellness\n\nIf any issue arises that may limit your ability to participate in class, for example, personal illness, family emergency, etc., please be sure to discuss these matters with me as soon as possible and accommodations will be made available to you as appropriate.\n\nFeelings of being overwhelmed are unfortunately quite common in the university environment. You are not alone, and there are a number of resources available to provide support in those moments. Learning to ask for help is an important part of the university experience, and if you or anyone you know experiences any academic stress, difficult life events, or feelings of anxiety or depression, we strongly encourage you to seek support. UR offers counseling services, and also consider reaching out to a friend, family or faculty member you trust for help.\n\nIf you or someone you know is feeling suicidal or in danger of self-harm, call someone immediately, day or night:\n* UR Counseling and Psychological Services: 804-289-8119\n* University of Richmond Police: 804-289-8911 \n* National Suicide Prevention Lifeline: 1-800-273-8255\n\n\n\n## Weinstein Learning Center\n\n[Academic Skills Center](asc.richmond.edu): Academic coaches assist students in assessing and developing their academic and life-skills (e.g., critical reading and thinking, information conceptualization, concentration, test preparation, time management, stress management, etc.). Peer tutors offer assistance in specific subject areas (e.g., calculus, chemistry, accounting, etc.) and will be available for appointments in-person and virtually. Peer tutors are listed on the ASC website. Email Roger Mancastroppa ([rmancast@richmond.edu](mailto:rmancast@richmond.edu)) and Hope Walton ([hwalton@richmond.edu](mailto:hwalton@richmond.edu)) for coaching appointments in academic and life skills.\n\n[English Language Learning](https://llc.richmond.edu/faculty/lbohon): assists multi-lingual and international students in honing their language, academic, and/or intercultural skills. Among other available services for students are one-on-one tutoring, group workshops, and semester-long classes on writing and U.S. culture. Please contact Dr. Bohon, Director of English Language Learning, at [Leslie.Bohon@Richmond.edu](mailto:Leslie.Bohon@Richmond.edu) for more information and appointments.\n\n[Quantitative Resource Center](https://qrc.richmond.edu): Provides services related to quantitative and computational learning across the curriculum through tutoring, consultation and training.\n\n[Speech Center](https://speech.richmond.edu): Assists with preparation and practice in the pursuit of excellence in public expression. Recording, playback, coaching and critique sessions are offered by teams of trained student consultants. During scheduled appointments, consultants assist in developing ideas, arranging key points for more effective organization, improving style and delivery, and handling multimedia aids for individual and group presentations. We look forward to meeting your public speaking needs.\n\n[Technology Learning Center](https://tlc.richmond.edu) The TLC is a staffed public lab dedicated to supporting digital media projects. Services include camera checkout, video/audio recording assistance, virtual reality, poster printing, 3D printing and modeling. The TLC is located on the second floor of Boatwright Library.\n\n[Writing Center](https://writing.richmond.edu): Assists writers at all levels of experience, across all majors. Students can attend walk-in hours at Boatwright Library (room 171A) with trained writing consultants who offer friendly critiques of written work.\n\n\n## Other Campus Services\n\n[Boatwright Library Research Librarians](https://library.richmond.edu/help/ask/) (289-8876): Research librarians help students with all steps of their research, from identifying or narrowing a topic, to locating, accessing, evaluating, and citing information resources. Librarians support students in their classes across the curriculum and provide individual appointments, class library instruction, tutorials, and research guides (libguides.richmond.edu). Students can contact an individual [librarian](https://library.richmond.edu/help/liaison-librarians.html) or ASK a librarian for help via [email](mailto:library@richmond.edu), text (804-277-9ASK), or [chat](https://library.richmond.edu/chat.html).\n\n[Career Services](https://careerservices.richmond.edu) (289-8547): Can assist you in exploring your interests and abilities, choosing a major or course of study, connecting with internships and jobs, and investigating graduate and professional school options. We encourage you to update your profile in Handshake and schedule an appointment with a career advisor early in your time at UR. \n\n[Counseling and Psychological Services](https://caps.richmond.edu) (289-8119): Assists currently enrolled, full-time, degree-seeking students in improving their mental health and well-being, and in handling challenges that may impede their growth and development. Services include brief consultations, short-term counseling, skills-building classes, therapy groups, crisis intervention, psychiatric consultation, and related services.\n","dir":"/","name":"README.md","path":"README.md","url":"/"},{"sort":1,"layout":"default","title":"Course Schedule","content":"# Course Schedule\n\n| Week | Lecture (Tue) | Lecture (Thr) | Lab (Fri) |\n| :--- | :--- | :--- | :--- |\n| 1 | Jan 16: <br />Topic - [Security Principles](../lectures/01-Security-Principles.pdf) | Jan 18: | Jan 19: <br />Lab 1 - Linux Fundamentals<br />**Due** [Textbook Discussion - Chapter 1](textbook) |\n| 2 | Jan 23: | Jan 25: | Jan 26: |\n| 3 | Jan 30: <br />**Due** [Research Reading 1](reactions) | Feb 1: | Feb 2: |\n| 4 | Feb 6: | Feb 8: | Feb 9: |\n| 5 | Feb 13: | Feb 15: | Feb 16: |\n| 6 | Feb 20: <br />**Due** [Research Reading 2](reactions) | Feb 22: | Feb 23: |\n| 7 | Feb 27: | Feb 29: | Mar 1: |\n| 8 | Mar 5: | Mar 7: | Mar 8: |\n| 9 | Mar 12: <br />**Spring Break** | Mar 14: <br />**Spring Break** | Mar 15: <br />**Spring Break** |\n| 10 | Mar 19: | Mar 21: | Mar 22: |\n| 11 | Mar 26: <br />**Due** [Research Reading 3](reactions) | Mar 28: | Mar 29: |\n| 12 | Apr 2: | Apr 4: | Apr 5: |\n| 13 | Apr 9: | Apr 11: | Apr 12: |\n| 14 | Apr 16: <br />**Due** [Research Reading 4](reactions) | Apr 18: | Apr 19: |\n| 15 | Apr 23: | Apr 25: | Apr 26: <br />**Due** Class Project |\n| 16 | | May 2 (2pm - 5pm):<br /> **Project Presentations** | |\n\n\n\n\n\n\n\n\n\n\n","dir":"/resources/","name":"schedule.md","path":"resources/schedule.md","url":"/resources/schedule.html"},{"sort":2,"permalink":"/resources/","layout":"default","title":"Resources","content":"<h1 id=\"resources\">Resources</h1>\n\n<ul>\n <li><a href=\"/resources/schedule.html\">Course Schedule</a></li>\n <li><a href=\"/resources/reactions.html\">Research Reading Assignments</a></li>\n <li><a href=\"/resources/textbook.html\">Textbook Reading Assignments</a></li>\n</ul>\n","dir":"/resources/","name":"README.md","path":"resources/README.md","url":"/resources/"},{"sort":2,"layout":"default","title":"Research Reading Assignments","content":"# Research Reading Assignments\n\n### Assignment 1 - Due January 30th, 11:59 PM\n* **A Two-Decade Retrospective Analysis of a University's Vulnerability to Attacks Exploiting Reused Password** by Nisenoff et al.\n* GitHub classroom assignment link: [https://classroom.github.com/a/KG2NKtSx](https://classroom.github.com/a/KG2NKtSx)\n\n### Assignment 2 - Due February 20th, 11:59 PM\n* **Thou Shalt Not Depend on Me: Analysing the Use of Outdated JavaScript Libraries on the Web** by Lauinger et al.\n* GitHub classroom assignment link: [https://classroom.github.com/a/kQsDF8mk](https://classroom.github.com/a/kQsDF8mk)\n\n### Assignment 3 - Due March 26th, 11:59 PM\n* **The Matter of Heartbleed** by Durumeric et al.\n* GitHub classroom assignment link: [https://classroom.github.com/a/tzWP7Zmm](https://classroom.github.com/a/tzWP7Zmm)\n\n### Assignment 4 - Due April 16th, 11:59 PM\n* **Choose your own paper**\n* GitHub classroom assignment link: [https://classroom.github.com/a/-fK81XJd](https://classroom.github.com/a/-fK81XJd)\n\n\n","dir":"/resources/","name":"reactions.md","path":"resources/reactions.md","url":"/resources/reactions.html"},{"sort":3,"layout":"default","title":"Textbook Reading Assignments","content":"# Textbook Reading Assignments\n\n**Textbook**\n\n- [Computer Security and the Internet: Tools and Jewels from Malware to Bitcoin, Second Edition](https://people.scs.carleton.ca/~paulv/toolsjewels.html) by Paul C. van Oorschot \n\n---\n\n**Setup**\n1. Read the assigned Chapter (or sections) of the textbook.\n2. We will read and discuss the textbook using a collaborative reading tool called hypothesis.\n - [https://web.hypothes.is/](https://web.hypothes.is/)\n3. Please create a free account on the hypothesis website and install the hypothes.is browser extension. \n - I recommend installing the extension on the Brave browser. [https://brave.com/](https://brave.com/)\n - Then join the class reading group.\n [https://hypothes.is/groups/XgW1ZwRE/ur-cmsc-334-spring-2024](https://hypothes.is/groups/XgW1ZwRE/ur-cmsc-334-spring-2024)\n4. Navigate to the assigned chapter. \n5. Click the hypothes.is extension to activate the extension for the pdf file. \n6. You may need to expand the extension from the tool bar on the right.\n7. Select the **UR CMSC 334 Spring 2024** group from the *My Groups* drop down menu.\n8. Click the reply button to reply to my discussion starter questions. \n9. Highlight text in the pdf to add your own annotations.\n10. Respond to other students annotations.\n\n---\n\n**Expectations**\n\n*Please complete the writing yourself.* I am interested in reading **your personal responses** to the discussion questions provided.\n\nThe following is required to earn full credit for the reading discussion assignments:\n- Answer __four or more__ of the questions that I have provided in annotations of the text. \n- Create __two or more__ annotations of your own inside the text. These can be in the form of comments, insights, or questions.\n- Respond to __two or more__ of your classmates annotations, questions, or answers to my questions to further the discussion.\n- Responses will be graded on engagement with the text and insightfulness of your ideas. \n- If you want to refer to other sources of information, please provide references and links.\n\n---\n\n### Chapter 1 - Due January 19th, 11:59 PM\nLink: [Chapter 1](https://people.scs.carleton.ca/~paulv/toolsjewels/TJrev1/ch1-rev1.pdf)\n\nTotal points: 10 \n\n","dir":"/resources/","name":"textbook.md","path":"resources/textbook.md","url":"/resources/textbook.html"}]